---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureVRepeat
source: html/e5465149-191a-f744-e956-7b0289c8af70.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureVRepeat Property

The property labeled "V Repeat" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureVRepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".